Repository: Shahadhq/ReadMedApp
Catalog: ReadMed/*.lproj/Localizable.strings
Languages: ar

source: Find important information about your medicine..
ar: يُمكنك إيجاد جميع المعلومات المتعلقة بدوائك هنا..

source: Search
ar: بحث

source: Dosage:
ar: الجرعة:

source: Side Effects:
ar: الآثارالجانبية:

source: Medicine interactions:
ar: تداخلات الدواء:

source: Panadol Extra
ar: باندول اكسترا

source: It’s an extra effective pain relief, for adults, take 2 tablets every 4 hours as required. Do not take more than 8 tablets in 24 hours
ar: ينتمي الباراسيتامول لمجموعة الآدوية المسكنة للآلام ، يستطيع البالغون أخذ حبتين كل ٤ ساعات حسب الجرعة المحددة ، مع عدم تجاوز الجرعة القصوى ٨ حبات لليوم الواحد

source: Paracetamol has no common side effects, unless you are allergic to paracetamol or any of the other ingredients
ar: لايوجد آثار جانبية شائعوة لهذا الدواء الا في حال التحسس من مادة الباراسيتامول أو من المكونات الأخرى

source: Paracetamol increases the anticoagulant effect of Acenocoumarol, Asparaginase, Atorvastatin,Bedaquiline,Busulfan, Carbamazepine. DO NOT TAKE WITH ANY OTHER PARACETAMOL CONTAINING PRODUCTS
ar: يزيد الباراسيتامول من التأثير المضاد للتخثر لأسينوكومارول، ألكتينيب،اسباراجيناز، أتورفاستاتين، بيداكويلين، بوسلفان،كاربامازيبين. لا تأخذ هذا الدواءأبدًا مع أي دواء آخر يحتوي على الباراسيتامول

source: Brufen
ar: بورفين

source: It is used to relieve pain from various conditions such as, dental pain, menstrual cramps. adult usually take 200-400 mg every 4-6 hours unless doctor directs you otherwise
ar: يُستخدم الأيبوبروفين في تسكين الأوجاع و التخفيف من ألم الأسنان،و الإنقباضات المرافقة للدورة الشهرية. يمكن للبالغين أخذ ٢٠٠-٤٠٠ ملليغرام كل ٤-٦ ساعات

source: Upset stomach, nausea, vomiting, diarrhea commonly occur. If any of these effects last or get worse, tell your doctor or pharmacist promptly
ar: الغثيان ، القيء، عسر الهضم من الاعراض شائعة الحدوث لهذا الدواء. يجب إيقافه في حال تطور هذه المضاعفات و ابلاغ الطبيب فورًا

source: Some products that may interact with thisdrug include: aliskiren(such as captopril, lisinopril), angiotensin II receptor blockers (such as losartan, valsartan), cidofovir,lithium, water pills (diuretics such as furosemide)
ar: بعض المنتجات التي قد تتفاعل مع هذا الدواء تشمل: أليسكرين (مثل كابتوبريل ، ليسينوبريل) ، حاصرات مستقبلات الأنجيوتنسين 2 (مثل لوسارتان ، فالسارتان) ، سيدوفوفير ، الكورتيكوستيرويدات (مثل بريدنيزون) ، الليثيوم ، حبوب الماء ( مدرات البول مثل فوروسيميد)

source: Lipitor
ar: ليبيتور

source: It is used along with a proper diet to help lower bad cholesterol. The dosage is based on your medical condition once a day at the same time
ar: يُستخدم هذا الدواء للتقليل من مستويات الكولسترول الضار في الجسم، تحدد الجرعة حسب الحالة المرضية وتؤخذ في وقت واحد، مرة في اليوم

source: Nifedipine
ar: نيفيديبين

source: It is used to treat severe chest pain or high blood pressure. Take it by mouth, usually 3 times daily as perscribed
ar: يُستخدم هذا الدواء لعلاج أمراض القلب وارتفاع ضغط الدم ، تحدد الجرعة حسب الحالة المرضية وتؤخذ ٣ مرات في اليوم

source: Dizziness, flushing, weakness, swelling ankles/feet, constipation, and headache may occur
ar: الدوخة، الضعف، وذمات الساقين، الامساك، الصداع تعتبر جميعها من الاعراض شائعة الحدوث لهذا الدواء. يجب ايقافه في حال تطور هذه المضاعفات وابلاغ الطبيب فوراً

source: These meducations may affect how nifedipine works: apalutamide, cimetidine, enzalutamide, mitotane, quinupristin/dalfopristin, rifabutin. drugs used to treat seizures (such as carbamazepine, phenytoin)
ar: قد تؤثر هذه الأدوية على كيفية عمل نيفيديبين: أبالوتاميد ، سيميتيدين ، إنزالوتاميد ، ميتوتان ، كينوبريستين / دالفوبريستين ، ريفابوتين. الأدوية المستخدمة لعلاج النوبات (مثل كاربامازيبين ، الفينيتوين)

source: Levothyroxine
ar: ليفوثيروكسين

source: It provides more thyroid hormone to treat an underactive thyroid gland. Take it as perscribed once daily on an empty stomach, 30 minutes to 1 hour before breakfast
ar: يُستخدم هذا الدواء كبديل اصطناعي للهرمون الطبيعي الذي تُنتجه الغدة الدرقية، تحدد الجرعة حسب الحالة المرضية وتؤخذ مرة في اليوم على معدة فارغة وقبل الافطار بساعة

source: Hair loss may occur during the first few months of treatment. This effect is usually temporary as your body adjusts to this medication
ar: يعتبر تساقط الشعر من الاعراض الممكن حدوثها في بداية العلاج ولكن سرعان مايختفي عند تعود الجسم عليه
